src/cf/Enums/СтатусыЯндексДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЯндексДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖдетПодтвержденияСлужбыДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвержденСлужбойДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвержденЕдинымСкладом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяНаЕдиномСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяВСлужбеДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЕдиномСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКПередачеВСлужбуДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданВСлужбуДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСкладеСлужбыДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВГородеПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставляетсяПоГороду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПунктеСамовывоза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовитсяКВозврату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвращенНаСкладСлужбыДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвращенНаЕдиныйСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКВозвратуВМагазин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвращенВМагазин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утерян</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусУточняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ЯндексДоставкаКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СтатусПоКоду(Код) Экспорт
	
	Коды = Новый Соответствие;
	Коды["DRAFT"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.Черновик");
	Коды["CREATED"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.Создан");
	Коды["SENDER_SENT"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ЖдетПодтвержденияСлужбыДоставки");
	Коды["DELIVERY_LOADED"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ПодтвержденСлужбойДоставки");
	Коды["ERROR"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.Ошибка");
	Коды["FULFILMENT_LOADED"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ПодтвержденЕдинымСкладом");
	Коды["SENDER_WAIT_FULFILMENT"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ОжидаетсяНаЕдиномСкладе");
	Коды["SENDER_WAIT_DELIVERY"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ОжидаетсяВСлужбеДоставки");
	Коды["FULFILMENT_ARRIVED"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.НаЕдиномСкладе");
	Коды["FULFILMENT_PREPARED"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ГотовКПередачеВСлужбуДоставки");
	Коды["FULFILMENT_TRANSMITTED"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ПереданВСлужбуДоставки");
	Коды["DELIVERY_AT_START"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.НаСкладеСлужбыДоставки");
	Коды["DELIVERY_TRANSPORTATION"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.Доставляется");
	Коды["DELIVERY_ARRIVED"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ВГородеПокупателя");
	Коды["DELIVERY_TRANSPORTATION_RECIPIENT"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ДоставляетсяПоГороду");
	Коды["DELIVERY_ARRIVED_PICKUP_POINT"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ВПунктеСамовывоза");
	Коды["DELIVERY_DELIVERED"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.Доставлен");
	Коды["RETURN_PREPARING"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ГотовитсяКВозврату");
	Коды["RETURN_ARRIVED_DELIVERY"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ВозвращенНаСкладСлужбыДоставки");
	Коды["RETURN_ARRIVED_FULFILMENT"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ВозвращенНаЕдиныйСклад");
	Коды["RETURN_PREPARING_SENDER"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ГотовКВозвратуВМагазин");
	Коды["RETURN_RETURNED"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.ВозвращенВМагазин");
	Коды["LOST"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.Утерян");
	Коды["UNEXPECTED"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.СтатусУточняется");
	Коды["CANCELED"] = ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.Отменен");
	
	Результат = Коды[ВРег(Код)];
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.СтатусыЯндексДоставки.СтатусУточняется");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
